Insert

In [1]:
import pandas as pd

In [2]:
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[6,7,8,9,10],"C":[11,12,13,14,15]})
var

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [3]:
var.insert(1,"python",var["A"])
var

   A  python   B   C
0  1       1   6  11
1  2       2   7  12
2  3       3   8  13
3  4       4   9  14
4  5       5  10  15

Copy The Values

In [4]:
var["Python_1"] = var["A"] [:3]
var

   A  python   B   C  Python_1
0  1       1   6  11       1.0
1  2       2   7  12       2.0
2  3       3   8  13       3.0
3  4       4   9  14       NaN
4  5       5  10  15       NaN

Delete

In [5]:
Var_1 = var.pop("B")
Var_1

0     6
1     7
2     8
3     9
4    10
Name: B, dtype: int64

In [6]:
var

   A  python   C  Python_1
0  1       1  11       1.0
1  2       2  12       2.0
2  3       3  13       3.0
3  4       4  14       NaN
4  5       5  15       NaN